MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX230F064B.PIC
      <edc:SFRDef edc:_addr="0x1F803420" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00749_ocmp_pb_v1.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="OC3RS" edc:desc="" edc:grp="OCMP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="OC3RS" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="OCMP3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OC3RS" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="OC3RS" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F803430" edc:offset="464"/>
      <edc:SFRDef edc:_addr="0x1F803600" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00749_ocmp_pb_v1.Module" edc:_refcount="4" edc:access="----------------n-n-------nrnnnn" edc:cname="OC4CON" edc:desc="" edc:grp="OCMP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-------000000" edc:name="OC4CON" edc:nzwidth="0x20" edc:por="----------------000-------000000" edc:portals="CLR SET INV" ltx:baseofperipheral="OCMP4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OCM" edc:desc="" edc:mask="0x7" edc:name="OCM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="OCTSEL" edc:desc="" edc:mask="0x1" edc:name="OCTSEL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OCFLT" edc:desc="" edc:mask="0x1" edc:name="OCFLT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC32" edc:desc="" edc:mask="0x1" edc:name="OC32" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="OCM0" edc:desc="" edc:mask="0x1" edc:name="OCM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OCM1" edc:desc="" edc:mask="0x1" edc:name="OCM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OCM2" edc:desc="" edc:mask="0x1" edc:name="OCM2" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="OCSIDL" edc:desc="" edc:mask="0x1" edc:name="OCSIDL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="OUTPUT COMPARE 4" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F803610" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00749_ocmp_pb_v1.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="OC4R" edc:desc="" edc:grp="OCMP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="OC4R" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="OCMP4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OC4R" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="OC4R" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F803620" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00749_ocmp_pb_v1.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="OC4RS" edc:desc="" edc:grp="OCMP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="OC4RS" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="OCMP4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OC4RS" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="OC4RS" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F803630" edc:offset="464"/>
      <edc:SFRDef edc:_addr="0x1F803800" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00749_ocmp_pb_v1.Module" edc:_refcount="5" edc:access="----------------n-n-------nrnnnn" edc:cname="OC5CON" edc:desc="" edc:grp="OCMP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-------000000" edc:name="OC5CON" edc:nzwidth="0x20" edc:por="----------------000-------000000" edc:portals="CLR SET INV" ltx:baseofperipheral="OCMP5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OCM" edc:desc="" edc:mask="0x7" edc:name="OCM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="OCTSEL" edc:desc="" edc:mask="0x1" edc:name="OCTSEL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OCFLT" edc:desc="" edc:mask="0x1" edc:name="OCFLT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC32" edc:desc="" edc:mask="0x1" edc:name="OC32" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="OCM0" edc:desc="" edc:mask="0x1" edc:name="OCM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OCM1" edc:desc="" edc:mask="0x1" edc:name="OCM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OCM2" edc:desc="" edc:mask="0x1" edc:name="OCM2" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="OCSIDL" edc:desc="" edc:mask="0x1" edc:name="OCSIDL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="OUTPUT COMPARE 5" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F803810" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00749_ocmp_pb_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="OC5R" edc:desc="" edc:grp="OCMP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="OC5R" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="OCMP5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OC5R" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="OC5R" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F803820" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00749_ocmp_pb_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="OC5RS" edc:desc="" edc:grp="OCMP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="OC5RS" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="OCMP5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OC5RS" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="OC5RS" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F803830" edc:offset="6096"/>
      <edc:SFRDef edc:_addr="0x1F805000" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00774_i2c_pb_v1.Module" edc:_refcount="1" edc:access="----------------n-nnnnnnnnnnnnnn" edc:cname="I2C1CON" edc:desc="" edc:grp="I2C" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0001000000000000" edc:name="I2C1CON" edc:nzwidth="0x20" edc:por="----------------0001000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="I2C1 I2C1A">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="I2C1ACON"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEN" edc:desc="" edc:mask="0x1" edc:name="SEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSEN" edc:desc="" edc:mask="0x1" edc:name="RSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN" edc:desc="" edc:mask="0x1" edc:name="PEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCEN" edc:desc="" edc:mask="0x1" edc:name="RCEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACKEN" edc:desc="" edc:mask="0x1" edc:name="ACKEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACKDT" edc:desc="" edc:mask="0x1" edc:name="ACKDT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STREN" edc:desc="" edc:mask="0x1" edc:name="STREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCEN" edc:desc="" edc:mask="0x1" edc:name="GCEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMEN" edc:desc="" edc:mask="0x1" edc:name="SMEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DISSLW" edc:desc="" edc:mask="0x1" edc:name="DISSLW" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="A10M" edc:desc="" edc:mask="0x1" edc:name="A10M" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRICT" edc:desc="" edc:mask="0x1" edc:name="STRICT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCLREL" edc:desc="" edc:mask="0x1" edc:name="SCLREL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="IPMIEN" edc:desc="" edc:mask="0x1" edc:name="IPMIEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="I2CSIDL" edc:desc="" edc:mask="0x1" edc:name="I2CSIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="I2CEN" edc:desc="" edc:mask="0x1" edc:name="I2CEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="I2C1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F805010" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00774_i2c_pb_v1.Module" edc:_refcount="1" edc:access="----------------rr---crrccrccrrr" edc:cname="I2C1STAT" edc:desc="" edc:grp="I2C" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00---00000000000" edc:name="I2C1STAT" edc:nzwidth="0x20" edc:por="----------------00---00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1 I2C1A">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="I2C1ASTAT"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TBF" edc:desc="" edc:mask="0x1" edc:name="TBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBF" edc:desc="" edc:mask="0x1" edc:name="RBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R_W" edc:desc="" edc:mask="0x1" edc:name="RW" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S" edc:desc="" edc:mask="0x1" edc:name="S" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P" edc:desc="" edc:mask="0x1" edc:name="P" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="D_A" edc:desc="" edc:mask="0x1" edc:name="DA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2COV" edc:desc="" edc:mask="0x1" edc:name="I2COV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IWCOL" edc:desc="" edc:mask="0x1" edc:name="IWCOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADD10" edc:desc="" edc:mask="0x1" edc:name="ADD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCSTAT" edc:desc="" edc:mask="0x1" edc:name="GCSTAT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BCL" edc:desc="" edc:mask="0x1" edc:name="BCL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="TRSTAT" edc:desc="" edc:mask="0x1" edc:name="TRSTAT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACKSTAT" edc:desc="" edc:mask="0x1" edc:name="ACKSTAT" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="I2CPOV" edc:desc="" edc:mask="0x1" edc:name="I2CPOV" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F805020" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00774_i2c_pb_v1.Module" edc:_refcount="1" edc:access="----------------------nnnnnnnnnn" edc:cname="I2C1ADD" edc:desc="" edc:grp="I2C" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="I2C1ADD" edc:nzwidth="0x20" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1 I2C1A">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="I2C1AADD"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CADD" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="I2CADD" edc:nzwidth="0xa"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F805030" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00774_i2c_pb_v1.Module" edc:_refcount="1" edc:access="----------------------nnnnnnnnnn" edc:cname="I2C1MSK" edc:desc="" edc:grp="I2C" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="I2C1MSK" edc:nzwidth="0x20" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1 I2C1A">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="I2C1AMSK"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CMSK" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="I2CMSK" edc:nzwidth="0xa"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F805040" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00774_i2c_pb_v1.Module" edc:_refcount="1" edc:access="--------------------nnnnnnnnnnnn" edc:cname="I2C1BRG" edc:desc="" edc:grp="I2C" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="I2C1BRG" edc:nzwidth="0x20" edc:por="--------------------000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1 I2C1A">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="I2C1ABRG"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CBRG" edc:desc="" edc:islanghidden="true" edc:mask="0xfff" edc:name="I2CBRG" edc:nzwidth="0xc"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F805050" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00774_i2c_pb_v1.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="I2C1TRN" edc:desc="" edc:grp="I2C" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="I2C1TRN" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1 I2C1A">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="I2C1ATRN"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CTRN" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="I2CTRN" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F805060" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00774_i2c_pb_v1.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="I2C1RCV" edc:desc="" edc:grp="I2C" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="I2C1RCV" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="- - -" ltx:memberofperipheral="I2C1 I2C1A">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="I2C1ARCV"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CRCV" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="I2CRCV" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F805070" edc:offset="144"/>
      <edc:SFRDef edc:_addr="0x1F805100" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00774_i2c_pb_v1.Module" edc:_refcount="2" edc:access="----------------n-nnnnnnnnnnnnnn" edc:cname="I2C2CON" edc:desc="" edc:grp="I2C" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0001000000000000" edc:name="I2C2CON" edc:nzwidth="0x20" edc:por="----------------0001000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="I2C2 I2C2A">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="I2C2ACON"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEN" edc:desc="" edc:mask="0x1" edc:name="SEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSEN" edc:desc="" edc:mask="0x1" edc:name="RSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN" edc:desc="" edc:mask="0x1" edc:name="PEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCEN" edc:desc="" edc:mask="0x1" edc:name="RCEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACKEN" edc:desc="" edc:mask="0x1" edc:name="ACKEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACKDT" edc:desc="" edc:mask="0x1" edc:name="ACKDT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STREN" edc:desc="" edc:mask="0x1" edc:name="STREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCEN" edc:desc="" edc:mask="0x1" edc:name="GCEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMEN" edc:desc="" edc:mask="0x1" edc:name="SMEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DISSLW" edc:desc="" edc:mask="0x1" edc:name="DISSLW" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="A10M" edc:desc="" edc:mask="0x1" edc:name="A10M" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRICT" edc:desc="" edc:mask="0x1" edc:name="STRICT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCLREL" edc:desc="" edc:mask="0x1" edc:name="SCLREL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="IPMIEN" edc:desc="" edc:mask="0x1" edc:name="IPMIEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="I2CSIDL" edc:desc="" edc:mask="0x1" edc:name="I2CSIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="I2CEN" edc:desc="" edc:mask="0x1" edc:name="I2CEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="I2C2" edc:pos="14"/>
      </edc:SFRDef>
